# BeginConnectorIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropItem..::..BeginConnectorIndex Property
DuctFittingAndAccessoryPressureDropItem Class See Also
---
The index of the begin connector of the flow path.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int BeginConnectorIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BeginConnectorIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int BeginConnectorIndex {
	int get ();
}
```

# See Also
DuctFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Mechanical Namespace